Construction/grid_dependence_template/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType RAS;

RAS
{
    RASModel SpalartAllmaras;
    turbulence on;
    printCoeffs on;
}