Construction/grid_dependence_template/system/extrudeMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}

// This file adds thickness to mesh.

constructFrom patch;
sourceCase "$FOAM_CASE";

sourcePatches (back);
exposedPatchName front;

extrudeModel linearDirection;
direction (0 -1 0);
thickness 0.1;

flipNormals false;
mergeFaces false;