Construction/grid_dependence_template/system/fvOptions
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}

limitT
{
    type limitTemperature;
    min 101;
    max 500;
    selectionMode all;
}