Construction/grid_dependence_template/system/samplePwall
upperSurfaceField {
    type            surfaceFieldValue;
    libs            ("libfieldFunctionObjects.so");

    writeControl    writeTime;
    writeFields     true;

    surfaceFormat   raw;
    regionType      patch;
    name            upperSurface;

    operation       none;

    fields
    (
        p
        yPlus
        wallShearStress
    );
}

lowerSurfaceField {
    type            surfaceFieldValue;
    libs            ("libfieldFunctionObjects.so");

    writeControl    writeTime;
    writeFields     true;

    surfaceFormat   raw;
    regionType      patch;
    name            lowerSurface;

    operation       none;

    fields
    (
        p
        yPlus
        wallShearStress
    );
}
